################################################################
################################################################
####
####     ____    ,,,,    ````    ----    \\\\    ////    <<<<
####_   ##########\\\\\\\\######################################
####_   ###########\\\\\\\\#####################################
####    ############\\\\\\\\####################################
####    #############\\\\\\\\###################################
####,   ##############\\\\\\\\##################################
####,   ###############\\\\\\\\#################################
####    ################\\\\\\\\##        #######  #############
####    #################\\\        #############  #############
####`   ##################\\\\\\\\  ###########  ###############
####`   ###################\\\\\\\  ###########  ###############
####    ##################                  #  #################
####    #####################\\\\    ########  #################
####-   ######################\  \  \  ####  ###################
####-   #####################  \\\  \\\  ##  #######  ##########
####    ###################  ###\\  \\\\#  ###########  ########
####    #########################\  \\\\\  ####        #  ######
####\   ##########################  \\\        ###########  ####
####\   ###########################\\\\\\\\#####################
####    ############################\\\\\\\\####################
####    #############################\\\\\\\\###################
####    ##############################\\\\\\\\##################
## 私（わたし）I
################################################################
## Design Twitter
################################################################
## Design a simplified version of Twitter where users can post tweets,
## follow#unfollow another user and is able to see the 10 most recent
## tweets in the user's news feed. Your design should support the
## following methods:
################################################################
## postTweet (userId, tweetId): Compose a new tweet.
## getNewsFeed (userId): Retrieve the 10 most recent tweet ids in
## the user's news feed (If total number of tweets in news feed is
## less than 10, then return all). Each item in the news feed must
## be posted by users who the user followed or by the user herself.
## Tweets must be ordered from most recent to least recent.
## follow (followerId, followeeId): Follower follows a followee.
## unfollow (followerId, followeeId): Follower unfollows a followee.
################################################################
## Input:
## postTweet(1, 5);
## getNewsFeed(1);
## follow(1, 2);
## postTweet(2, 6);
## getNewsFeed(1);
## unfollow(1, 2);
## getNewsFeed(1);
## Output:
## [5]
## [6, 5]
## [5]
## Explanation: 
## postTweet(1,5): User 1 posts a new tweet (id=5)
## getNewsFeed(1): Return a list with 1 tweet [5]
## follow(1,2)   : User 1 follows user 2.
## postTweet(2,6): User 2 posts a new tweet (id=6)
## getNewsFeed(1): Return a list with 2 tweets 
## [6,5]. One his own tweet and one followee's tweet
## (sorted from most recent to least recent).
## unfollow(1,2) : User 1 unfollows user 2
## getNewsFeed(1): Return a list with 1 tweet [5],
## because user 1 is no longer following anyone.
################################################################
## 1 <= no. of queries <= 1000
## 1 <= userId, tweetId, followerId, followeeId <= 10^5
################################################################
################################################################
# 11 elf elf elf elf elf elf elf elf elf elf elf elf elf elf elf
# 12 zwölf   zwölf   zwölf   zwölf   zwölf   zwölf   zwölf   zwölf
# 13 dreizehn    dreizehn    dreizehn    dreizehn    dreizehn
# 14 vierzehn    vierzehn    vierzehn    vierzehn    vierzehn
# 15 fünfzehn    fünfzehn    fünfzehn    fünfzehn    fünfzehn
# 16 sechzehn    sechzehn    sechzehn    sechzehn    sechzehn    
# 17 siebzehn    siebzehn    siebzehn    siebzehn    siebzehn    
# 18 achtzehn    achtzehn    achtzehn    achtzehn    achtzehn    
# 19 neunzehn    neunzehn    neunzehn    neunzehn    neunzehn    
# 20 zwanzig zwanzig zwanzig zwanzig zwanzig zwanzig zwanzig zwanzig 
#  #  ######  ##############  ##############################  ##
###  #  ######  ##############  ##############################  
#####  #  ######  ##############  ##############################
#######  #  ######  ##############  ############################
#########  #  ######  ##############  ##########################
###########  #  ######  ##############  ########################
#############  #  ######  ##############  ######################
###############  #  ######  ##############  ####################
#################  #  ######  ##############  ##################
###################  #  ######  ##############  ################
Posts = {}
def get_posts( user_id ):
    if user_id not in Posts:
        Posts[ user_id ] = set()
    return Posts[ user_id ]
################################################################
################################################################
Subscriptions = {}
def get_subscriptions( user_id ):
    if user_id not in Subscriptions:
        Subscriptions[ user_id ] = set()
    return Subscriptions[ user_id ]
################################################################
################################################################
class Twitter:
    clock = 0
    # Compose a new tweet
    def postTweet( self, user_id, tweet_id ):
        Twitter.clock += 1
        get_posts( user_id ).add(( Twitter.clock, tweet_id ))
        
    # Retrieve the 10 most recent tweet ids as mentioned in question
    def getNewsFeed( self, user_id ):
        s = get_posts( user_id )
        for f in get_subscriptions( user_id ):
            s = s.union( get_posts( f ))
        return [ y[1] for y in sorted ( s, reverse=True )[:10]]
        
    # Follower follows a followee.
    def follow( self, follower_id, followee_id ):
        get_subscriptions( follower_id ).add( followee_id )
        
    # Follower unfollows a followee.
    def unfollow( self, follower_id, followee_id ):
        get_subscriptions( follower_id ).remove( followee_id )
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
if __name__ == '__main__': #####################################
    obj = Twitter() ############################################
    totalQueries = int(input ()) ###############################
    for _ in range (totalQueries): #############################
        query = list(map(int, input().split())) ################
        if (query[0] == 1): ####################################
            userId, tweetId = query[1], query[2] ###############
            obj.postTweet(userId, tweetId) #####################
        elif (query[0] == 2): ##################################
            userId =  query[1] #################################
            vec = obj.getNewsFeed(userId) ######################
            for val in vec: ####################################
                print(val, end = ' ') ##########################
            print() ############################################
        elif (query[0] == 3): ##################################
            follower, followee = query[1], query[2] ############
            obj.follow(follower, followee) #####################
        else: ##################################################
            follower, followee = query[1], query[2] ############
            obj.unfollow(follower, followee) ###################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
################################################################
#  7. スーさんの　せんこうは　けいざいおですか。
#     いいえ、コンピュ−ターです。
#  8. ロバートさんの　せんこうは　ビジネスですか。
#     ええ、そうです。
#  9. ロバートさんは　よねんせいですか。
#     ええ、そうです。
# 10. ロバーとさんは　にじゅういっさいですか。
#     いいえ、にじゅうにさいです。
# 11. やましたせんせいは　にほんじんですか。
#     ええ、そうです。
# 12. やましたせんせいは　ハワイだいがくの　せんせいですか。
#     いいえ、さくらだいがくの　せんせいです。
################################################################
################################################################
################################################################
# Test Cases Passed:                                       4 / 4
# Total Points Scored:                                     4 / 4
# Your Total Score:                                         1386
# Total Time Taken:                                         0.02
